import { BurgerMenuInit } from './modules/menu-burger.js';
import { SelectInit } from './modules/select.js';
import { MoveToInit } from './modules/move-to.js';
import { PopupInit } from './modules/popup.js';
import { FormRequiredInit } from './modules/form-required.js';
import * as flsFunstions from "./modules/functions.js";
flsFunstions.isWebp();
//========================================================================================================================================================================================================================================================================================
// Slider від Swiper.js
// Розкоментувати в разі необхідності
// import Swiper, { Navigation, Pagination } from 'swiper';
// const swiper = new Swiper('');
//========================================================================================================================================================================================================================================================================================
// Menu Burger
// Розкоментувати в разі необхідності
// можна передати класи,
// за замовчування стоїть кнопка "icon-burger" і оболонка меню nav "header__menu" !!! без крапкок
// Приклад burgerMenu("icon-burger", "header__menu");
BurgerMenuInit();
//========================================================================================================================================================================================================================================================================================
// Custom Select
// Розкоментувати в разі необхідності
// let searchInBtn = false, // true = кнопка випадаючого select стає рядком вводу для пошуку
//     caseSensitive = false; // true = чутливий до регістру
// SelectInit(searchInBtn, caseSensitive);
//========================================================================================================================================================================================================================================================================================
// Star Rating
// flsFunstions.StarRating();
//========================================================================================================================================================================================================================================================================================
// Move To Another Block
// defaultPlace = "last", defaultBreackpoint = '767', defaultMediaType = "max"
MoveToInit();
//========================================================================================================================================================================================================================================================================================
// Form Required
// data-form-req - батькіський елемент, здебільшого тег <form>
// значення data-form-req може буди пустим або зі значенням 'getErrorClass' - навішується клас 'error' в разі хочаб однієї помилки
//=====================
// data-required - тип required перевірки ('', 'email', 'phone-number')
// '' - непусте значення value
//=====================
// data-req-error-for - значення атрибута - клас елемента, на який треба навісити клас 'error' !!! без крапкок
FormRequiredInit();
//========================================================================================================================================================================================================================================================================================
// Popup
// data-popup-open - btn for open, data-popup - popup obj, data-popup-close - close popup
PopupInit();
//========================================================================================================================================================================================================================================================================================
